Финансы/src/Documents/СчетНаОплату/СчетНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату</name>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ПланируемыеРасходы</registerRecords>
  <registerRecords>InformationRegister.ИсторияЦенПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расшифровка</name>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Финансы/src/AccumulationRegisters/ПланируемыеРасходы/ПланируемыеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланируемыеРасходы</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Финансы/src/Documents/СчетНаОплату/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	МестоРасходовДенежныхСредств = Константы.ОсновноеМестоРасходаДенежныхСредств.Получить();
	СчетУчета = Константы.ОсновнойСчетУчета.Получить();
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		ВалютаДокумента = СчетУчета.ВалютаСчета;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Расшифровка.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыДвижений(ТаблицаПланируемыеРасходы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплату.Дата КАК Период,
	               |	СчетНаОплату.СчетУчета,
	               |	СчетНаОплату.ПлановаяДатаПлатежа,
	               |	СчетНаОплатуРасшифровка.Ссылка КАК СчетНаОплату,
	               |	СУММА(СчетНаОплатуРасшифровка.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
	               |ИЗ
	               |	Документ.СчетНаОплату.Расшифровка КАК СчетНаОплатуРасшифровка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплату КАК СчетНаОплату
	               |		ПО СчетНаОплатуРасшифровка.Ссылка = СчетНаОплату.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуРасшифровка.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплату.Дата,
	               |	СчетНаОплату.СчетУчета,
	               |	СчетНаОплату.ПлановаяДатаПлатежа,
	               |	СчетНаОплатуРасшифровка.Ссылка";

	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();

	ТаблицаПланируемыеРасходы	= МассивРезультатов[0].Выгрузить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
Перем ТаблицаПланируемыеРасходы, ТаблицаДвиженийДенежныхСредств, ТаблицаИсторияЦенПокупок;
	
	ЗаполнитьТаблицыДвижений(ТаблицаПланируемыеРасходы);
	
	Если ТаблицаПланируемыеРасходы.Количество() <> 0 Тогда
		
		Движения.ПланируемыеРасходы.Записывать = Истина;
		Движения.ПланируемыеРасходы.Загрузить(ТаблицаПланируемыеРасходы);
		
	КонецЕсли;

КонецПроцедуры

мВалютаРегламентированногоУчета = Константы.ОсновнаяВалютаУчета.Получить();
